Repository: fangjunyu1/SwiftSlim
Catalog: SwiftSlim/Localization/Localizable.xcstrings
Source language: en
Languages: ar, bg, bn, ca, cs, da, de, el, es, fi, fr, gu, he, hi, hr, hu, id, it, ja, kk, kn, ko, lt, ml, mr, ms, nb, nl, or, pa, pl, pt, ro, ru, sk, sl, sv, ta, te, th, tr, uk, ur, vi, zh_hans, zh_hant

source: Start with the fundamentals, learn common SwiftUI patterns step by step, and build a clear development mindset.
ar: ابدأ من الأساسيات وتعلّم استخدامات SwiftUI الشائعة خطوةً بخطوة لبناء فهم واضح للتطوير.
bg: От основите нататък изучавайте постепенно често използваните начини за работа със SwiftUI и изградете ясен подход към разработката.
bn: মৌলিক বিষয় থেকে শুরু করে ধাপে ধাপে SwiftUI-এর সাধারণ ব্যবহার শিখে পরিষ্কার ডেভেলপমেন্ট ধারণা গড়ে তুলুন।
ca: Comença pels continguts bàsics, aprèn a poc a poc els usos més habituals de SwiftUI i construeix una idea clara del desenvolupament.
cs: Začněte od základů, postupně se učte běžné použití SwiftUI a vybudujte si jasný přístup k vývoji.
da: Start med det grundlæggende, lær de mest almindelige måder at bruge SwiftUI på trin for trin, og opbyg en klar forståelse af udvikling.
de: Beginnen Sie mit den Grundlagen, lernen Sie Schritt für Schritt die gängigen Anwendungen von SwiftUI und entwickeln Sie ein klares Verständnis für die Entwicklung.
el: Ξεκινήστε από τα βασικά, μάθετε σταδιακά τις συνηθισμένες χρήσεις του SwiftUI και διαμορφώστε μια ξεκάθαρη λογική ανάπτυξης.
es: Empieza por lo básico, aprende poco a poco los usos más comunes de SwiftUI y construye una idea clara del desarrollo.
fi: Aloita perusteista, opi SwiftUI:n yleiset käyttötavat vaihe vaiheelta ja rakenna selkeä käsitys sovelluskehityksestä.
fr: Commencez par les bases, apprenez progressivement les usages courants de SwiftUI et construisez une logique de développement claire.
gu: મૂળભૂત સામગ્રીથી શરૂઆત કરો, ધીમે ધીમે SwiftUI ના સામાન્ય ઉપયોગો શીખો અને વિકાસ માટે સ્પષ્ટ સમજ બનાવો.
he: התחילו מהיסודות, למדו בהדרגה את השימושים הנפוצים של SwiftUI, ובנו דרך חשיבה ברורה לפיתוח.
hi: बुनियादी सामग्री से शुरू करें, धीरे-धीरे SwiftUI के सामान्य उपयोग सीखें, और विकास की स्पष्ट समझ बनाएं।
hr: Krenite od osnova, postupno učite najčešće načine korištenja SwiftUI-ja i izgradite jasan razvojni način razmišljanja.
hu: Kezdje az alapokkal, fokozatosan tanulja meg a SwiftUI gyakori használatát, és alakítson ki világos fejlesztési szemléletet.
id: Mulailah dari dasar, pelajari penggunaan umum SwiftUI secara bertahap, dan bangun pemahaman pengembangan yang jelas.
it: Inizia dalle basi, impara gradualmente gli usi più comuni di SwiftUI e costruisci un approccio chiaro allo sviluppo.
ja: 基礎内容から始めて、SwiftUI の一般的な使い方を少しずつ学び、明確な開発の考え方を身につけましょう。
kk: Негіздерден бастаңыз, SwiftUI-дің жиі қолданылатын тәсілдерін біртіндеп үйреніп, әзірлеудің айқын түсінігін қалыптастырыңыз.
kn: ಮೂಲಭುತ ವಿಷಯಗಳಿಂದ ಆರಂಭಿಸಿ, ಹಂತ ಹಂತವಾಗಿ SwiftUI ಯ ಸಾಮಾನ್ಯ ಬಳಕೆಗಳನ್ನು ಕಲಿಯಿರಿ ಮತ್ತು ಅಭಿವೃದ್ಧಿಯ ಸ್ಪಷ್ಟ ಆಲೋಚನೆ ರೂಪಿಸಿಕೊಳ್ಳಿ.
ko: 기초 내용부터 시작해 SwiftUI의 자주 쓰는 사용법을 단계적으로 배우고, 명확한 개발 사고를 세워보세요.
lt: Pradėkite nuo pagrindų, po truputį mokykitės įprastų SwiftUI naudojimo būdų ir susikurkite aiškų požiūrį į kūrimą.
ml: അടിസ്ഥാനങ്ങളിൽ നിന്ന് തുടങ്ങുക, SwiftUIയുടെ സാധാരണ ഉപയോഗങ്ങൾ ഘട്ടംഘട്ടമായി പഠിക്കുക, വികസനത്തെക്കുറിച്ചുള്ള വ്യക്തമായ ധാരണ രൂപപ്പെടുത്തുക.
mr: मूलभूत गोष्टींपासून सुरुवात करा, हळूहळू SwiftUI चे सामान्य उपयोग शिका आणि विकासाची स्पष्ट समज तयार करा.
ms: Mulakan dengan asas, pelajari penggunaan biasa SwiftUI secara beransur-ansur, dan bina pemahaman pembangunan yang jelas.
nb: Start med det grunnleggende, lær vanlige måter å bruke SwiftUI på steg for steg, og bygg en tydelig forståelse av utvikling.
nl: Begin met de basis, leer stap voor stap de meest gebruikte toepassingen van SwiftUI en bouw een duidelijke ontwikkelgedachte op.
or: ମୂଳ ଆଧାରରୁ ଆରମ୍ଭ କରନ୍ତୁ, ପର୍ଯ୍ୟାୟକ୍ରମେ SwiftUI ର ସାଧାରଣ ବ୍ୟବହାର ଶିଖନ୍ତୁ, ଏବଂ ବିକାଶ ସମ୍ପର୍କରେ ସ୍ପଷ୍ଟ ଧାରଣା ଗଢ଼ନ୍ତୁ।
pa: ਬੁਨਿਆਦੀ ਸਮੱਗਰੀ ਤੋਂ ਸ਼ੁਰੂ ਕਰੋ, ਹੌਲੀ-ਹੌਲੀ SwiftUI ਦੇ ਆਮ ਵਰਤਾਰੇ ਸਿੱਖੋ ਅਤੇ ਵਿਕਾਸ ਬਾਰੇ ਸਾਫ਼ ਸਮਝ ਬਣਾਓ।
pl: Zacznij od podstaw, stopniowo ucz się najczęstszych zastosowań SwiftUI i zbuduj jasne podejście do tworzenia aplikacji.
pt: Comece pelo básico, aprenda aos poucos os usos mais comuns do SwiftUI e construa uma visão clara de desenvolvimento.
ro: Începeți cu noțiunile de bază, învățați treptat utilizările comune ale SwiftUI și construiți o gândire clară pentru dezvoltare.
ru: Начните с основ, постепенно изучайте распространённые способы использования SwiftUI и формируйте чёткое понимание разработки.
sk: Začnite od základov, postupne sa učte bežné spôsoby používania SwiftUI a vytvorte si jasný prístup k vývoju.
sl: Začnite z osnovami, postopoma spoznavajte pogoste načine uporabe SwiftUI-ja in oblikujte jasno predstavo o razvoju.
sv: Börja med grunderna, lär dig steg för steg de vanligaste sätten att använda SwiftUI och bygg upp en tydlig förståelse för utveckling.
ta: அடிப்படையிலிருந்து தொடங்கி, SwiftUI-ի பொதுவான பயன்பாடுகளை படிப்படியாக கற்றுக்கொண்டு, மேம்பாட்டிற்கான தெளிவான புரிதலை உருவாக்குங்கள்.
te: ప్రాథమిక విషయాలతో ప్రారంభించి, SwiftUI యొక్క సాధారణ వినియోగాలను దశలవారీగా నేర్చుకుని, అభివృద్ధిపై స్పష్టమైన అవగాహనను నిర్మించండి.
th: เริ่มจากเนื้อหาพื้นฐาน ค่อย ๆ เรียนรู้การใช้งาน SwiftUI ที่พบบ่อย และสร้างแนวคิดการพัฒนาที่ชัดเจน
tr: Temel içeriklerden başlayın, SwiftUI’nin yaygın kullanımlarını adım adım öğrenin ve geliştirme için net bir bakış oluşturun.
uk: Почніть з основ, поступово вивчайте поширені способи використання SwiftUI та сформуйте чітке розуміння розробки.
ur: بنیادی مواد سے آغاز کریں، آہستہ آہستہ SwiftUI کے عام استعمالات سیکھیں، اور ترقی کے لیے واضح سمجھ بنائیں۔
vi: Bắt đầu từ nội dung cơ bản, từng bước học các cách dùng phổ biến của SwiftUI và xây dựng tư duy phát triển rõ ràng.
zh_hans: 从基础内容开始，逐步学习 SwiftUI 常见用法，建立清晰的开发思路。
zh_hant: 從基礎內容開始，逐步學習 SwiftUI 常見用法，建立清晰的開發思路。

source: Starting now, write your first line of code and gradually build your very first app.
ar: من الآن، جرّب كتابة أول سطر برمجي وابدأ تدريجيًا في بناء تطبيقك الأول.
bg: Започнете още сега, опитайте да напишете първия си ред код и постепенно създайте първото си собствено приложение.
bn: এখন থেকেই প্রথম কোডের লাইনটি লিখে ধীরে ধীরে আপনার প্রথম App তৈরি করা শুরু করুন।
ca: Comença ara, prova d’escriure la teva primera línia de codi i ves construint a poc a poc la teva primera app.
cs: Začněte hned teď, zkuste napsat svůj první řádek kódu a postupně vytvořte svou první aplikaci.
da: Start nu, prøv at skrive din første linje kode, og byg langsomt din første app.
de: Beginnen Sie jetzt, schreiben Sie Ihre erste Codezeile und bauen Sie nach und nach Ihre erste App.
el: Ξεκινήστε τώρα, δοκιμάστε να γράψετε την πρώτη σας γραμμή κώδικα και χτίστε σταδιακά την πρώτη σας εφαρμογή.
es: Empieza ahora, intenta escribir tu primera línea de código y construye poco a poco tu primera app.
fi: Aloita nyt, kokeile kirjoittaa ensimmäinen koodirivisi ja rakenna vähitellen ensimmäinen sovelluksesi.
fr: Commencez dès maintenant, essayez d’écrire votre première ligne de code et créez progressivement votre première app.
gu: હવે જ શરૂઆત કરો, તમારી પહેલી કોડ લાઇન લખવાનો પ્રયાસ કરો અને ધીમે ધીમે તમારી પહેલી એપ બનાવો.
he: התחילו עכשיו, נסו לכתוב את שורת הקוד הראשונה שלכם, ובנו בהדרגה את האפליקציה הראשונה שלכם.
hi: अभी शुरू करें, अपनी पहली कोड पंक्ति लिखने की कोशिश करें, और धीरे-धीरे अपना पहला ऐप बनाएं।
hr: Počnite odmah, pokušajte napisati svoj prvi redak koda i postupno izgradite svoju prvu aplikaciju.
hu: Kezdje el most, próbálja meg leírni az első kódsorát, és fokozatosan építse fel az első alkalmazását.
id: Mulai sekarang, coba tulis baris kode pertamamu, dan bangun aplikasi pertamamu secara bertahap.
it: Inizia da ora, prova a scrivere la tua prima riga di codice e costruisci poco a poco la tua prima app.
ja: 今から始めて、最初の1行のコードを書いてみて、少しずつ自分だけの最初のアプリを作っていきましょう。
kk: Дәл қазір бастаңыз, алғашқы кодыңыздың жолын жазып көріңіз және өзіңіздің алғашқы қолданбаңызды біртіндеп құрастырыңыз.
kn: ಈಗಲೇ ಪ್ರಾರಂಭಿಸಿ, ನಿಮ್ಮ ಮೊದಲ ಕೋಡ್ ಸಾಲನ್ನು ಬರೆಯಲು ಪ್ರಯತ್ನಿಸಿ ಮತ್ತು ನಿಧಾನವಾಗಿ ನಿಮ್ಮ ಮೊದಲ ಆಪ್ ಅನ್ನು ನಿರ್ಮಿಸಿರಿ.
ko: 지금부터 시작해 첫 번째 코드 한 줄을 써 보고, 천천히 나만의 첫 App을 만들어 보세요.
lt: Pradėkite dabar, pabandykite parašyti pirmąją kodo eilutę ir pamažu kurkite savo pirmąją programėlę.
ml: ഇപ്പോൾ തന്നെ തുടങ്ങൂ, നിങ്ങളുടെ ആദ്യ കോഡ് വരി എഴുതാൻ ശ്രമിക്കൂ, പിന്നെ പതുക്കെ നിങ്ങളുടെ ആദ്യ ആപ്പ് നിർമ്മിക്കൂ.
mr: आत्ताच सुरू करा, तुमची पहिली कोडची ओळ लिहून पाहा आणि हळूहळू तुमचे पहिले अॅप तयार करा.
ms: Mulakan sekarang, cuba tulis baris kod pertama anda, dan bina aplikasi pertama anda sedikit demi sedikit.
nb: Start nå, prøv å skrive din første kodelinje, og bygg gradvis din første app.
nl: Begin nu, probeer je eerste regel code te schrijven en bouw stap voor stap aan je eerste app.
or: ଏବେଠାରୁ ଆରମ୍ଭ କରନ୍ତୁ, ନିଜର ପ୍ରଥମ କୋଡ୍ ଲାଇନ୍ ଲେଖିବାକୁ ଚେଷ୍ଟା କରନ୍ତୁ, ଏବଂ ଧୀରେ ଧୀରେ ନିଜର ପ୍ରଥମ ଆପ୍ ତିଆରି କରନ୍ତୁ।
pa: ਹੁਣੇ ਤੋਂ ਸ਼ੁਰੂ ਕਰੋ, ਆਪਣੀ ਪਹਿਲੀ ਕੋਡ ਲਾਈਨ ਲਿਖਣ ਦੀ ਕੋਸ਼ਿਸ਼ ਕਰੋ ਅਤੇ ਹੌਲੀ-ਹੌਲੀ ਆਪਣੀ ਪਹਿਲੀ ਐਪ ਬਣਾਓ।
pl: Zacznij już teraz, spróbuj napisać swoją pierwszą linię kodu i stopniowo twórz swoją pierwszą aplikację.
pt: Comece agora, tente escrever sua primeira linha de código e vá construindo aos poucos seu primeiro app.
ro: Începeți chiar acum, încercați să scrieți prima linie de cod și construiți treptat prima voastră aplicație.
ru: Начните прямо сейчас, попробуйте написать первую строку кода и постепенно создайте своё первое приложение.
sk: Začnite hneď teraz, skúste napísať svoj prvý riadok kódu a postupne vytvorte svoju prvú aplikáciu.
sl: Začnite zdaj, poskusite napisati svojo prvo vrstico kode in postopoma zgradite svojo prvo aplikacijo.
sv: Börja nu, prova att skriva din första rad kod och bygg steg för steg din första app.
ta: இப்போதே தொடங்குங்கள், உங்கள் முதல் குறியீட்டு வரியை எழுதிப் பார்த்து, மெதுவாக உங்கள் முதல் ஆப்பை உருவாக்குங்கள்.
te: ఇప్పుడే ప్రారంభించండి, మీ మొదటి కోడ్ పంక్తిని రాయడానికి ప్రయత్నించి, మెల్లగా మీ మొదటి యాప్‌ను నిర్మించండి.
th: เริ่มตั้งแต่ตอนนี้ ลองเขียนโค้ดบรรทัดแรกของคุณ แล้วค่อย ๆ สร้างแอปแรกของคุณขึ้นมา
tr: Şimdi başlayın, ilk kod satırınızı yazmayı deneyin ve ilk uygulamanızı yavaş yavaş oluşturun.
uk: Почніть уже зараз, спробуйте написати свій перший рядок коду та поступово створіть свій перший застосунок.
ur: ابھی سے شروع کریں، اپنی پہلی کوڈ لائن لکھنے کی کوشش کریں، اور آہستہ آہستہ اپنی پہلی ایپ بنائیں۔
vi: Bắt đầu ngay từ bây giờ, thử viết dòng mã đầu tiên của bạn và dần dần xây dựng ứng dụng đầu tiên của mình.
zh_hans: 从现在开始，尝试写下第一行代码，慢慢构建属于你的第一个 App。
zh_hant: 從現在開始，嘗試寫下第一行程式碼，慢慢打造屬於你的第一個 App。

source: Stop
ar: إيقاف
bg: Спри
bn: থামান
ca: Atura
cs: Zastavit
de: Stoppen
el: Διακοπή
es: Detener
fi: Pysäytä
fr: Arrêter
gu: રોકો
he: עצור
hi: रोकें
hr: Zaustavi
hu: Leállítás
id: Hentikan
it: Arresta
ja: 停止
kk: Тоқтату
kn: ನಿಲ್ಲಿಸಿ
ko: 중지
lt: Stabdyti
ml: നിർത്തുക
mr: थांबवा
ms: Henti
nb: Stopp
nl: Stoppen
or: ବନ୍ଦ କରନ୍ତୁ
pa: ਰੋਕੋ
pl: Zatrzymaj
pt: Parar
ro: Oprește
ru: Остановить
sk: Zastaviť
sl: Ustavi
sv: Stoppa
ta: நிறுத்து
te: ఆపు
th: หยุด
tr: Durdur
uk: Зупинити
ur: روکیں
vi: Dừng
zh_hans: 停止运行
zh_hant: 停止執行

source: struct and class
ar: struct و class
bg: struct и class
bn: struct এবং class
ca: struct i class
cs: struct a class
da: struct og class
de: struct und class
el: struct και class
es: struct y class
fi: struct ja class
fr: struct et class
gu: struct અને class
he: struct ו-class
hi: struct और class
hr: struct i class
hu: struct és class
id: struct dan class
it: struct e class
ja: struct と class
kk: struct және class
kn: struct ಮತ್ತು class
ko: struct와 class
lt: struct ir class
ml: struct ഉം class ഉം
mr: struct आणि class
ms: struct dan class
nb: struct og class
nl: struct en class
or: struct ଏବଂ class
pa: struct ਅਤੇ class
pl: struct i class
pt: struct e class
ro: struct și class
ru: struct и class
sk: struct a class
sl: struct in class
sv: struct och class
ta: struct மற்றும் class
te: struct మరియు class
th: struct และ class
tr: struct ve class
uk: struct і class
ur: struct اور class
vi: struct và class
zh_hans: struct 和 class
zh_hant: struct 和 class

source: Support
ar: الدعم
bg: Поддръжка
bn: সহায়তা
ca: Suport
cs: Podpora
de: Hilfe
el: Υποστήριξη
es: Ayuda
fi: Tuki
fr: Aide
gu: સહાય
he: תמיכה
hi: सहायता
hr: Podrška
hu: Súgó
id: Bantuan
it: Supporto
ja: サポート
kk: Қолдау
kn: ಸಹಾಯ
ko: 지원
lt: Pagalba
ml: സഹായം
mr: मदत
ms: Sokongan
nb: Hjelp
or: ସହାୟତା
pa: ਮਦਦ
pl: Pomoc
pt: Ajuda
ro: Ajutor
ru: Поддержка
sk: Pomoc
sl: Pomoč
sv: Hjälp
ta: உதவி
te: సహాయం
th: ช่วยเหลือ
tr: Destek
uk: Підтримка
ur: مدد
vi: Hỗ trợ
zh_hans: 支持
zh_hant: 支援

source: Swift and SwiftUI
ar: Swift وSwiftUI
bg: Swift и SwiftUI
bn: Swift এবং SwiftUI
ca: Swift i SwiftUI
cs: Swift a SwiftUI
da: Swift og SwiftUI
de: Swift und SwiftUI
el: Swift και SwiftUI
es: Swift y SwiftUI
fi: Swift ja SwiftUI
fr: Swift et SwiftUI
gu: સ્વિફ્ટ અને સ્વિફ્ટયુઆઈ
he: סוויפט ו- SwiftUI
hi: स्विफ्ट और स्विफ्टयूआई
hr: Swift i SwiftUI
hu: Swift és SwiftUI
id: Swift dan SwiftUI
it: Swift e SwiftUI
ja: Swift と SwiftUI
kk: Swift және SwiftUI
kn: ಸ್ವಿಫ್ಟ್ ಮತ್ತು ಸ್ವಿಫ್ಟ್‌ಯುಐ
ko: Swift와 SwiftUI
lt: Swift ir SwiftUI
ml: സ്വിഫ്റ്റും സ്വിഫ്റ്റയൂഐ
mr: स्विफ्ट आणि स्विफ्टयूआय
ms: Swift dan SwiftUI
nb: Swift og SwiftUI
nl: Swift en SwiftUI
or: ସ୍ୱିଫ୍ଟ ଏବଂ ସ୍ୱିଫ୍ଟୟୁଆଇ
pa: ਸਵਿਫਟ ਅਤੇ ਸਵਿਫਟਯੂਆਈ
pl: Swift i SwiftUI
pt: Swift e SwiftUI
ro: Swift și SwiftUI
ru: Swift и SwiftUI
sk: Swift a SwiftUI
sl: Swift in SwiftUI
sv: Swift och SwiftUI
ta: ஸ்விஃப்ட் மற்றும் ஸ்விஃப்ட்யூஐ
te: స్విఫ్ట్ మరియు స్విఫ్ట్‌యూ‌ఐ
th: Swift และ SwiftUI
tr: Swift ve SwiftUI
uk: Swift та SwiftUI
ur: سوئفٹ اور سوئفٹی یو آئی
vi: Swift và SwiftUI
zh_hans: Swift 和 SwiftUI
zh_hant: Swift 和 SwiftUI

source: SwiftUI Beginner Tutorial
ar: دليل SwiftUI للمبتدئين
bg: Начално ръководство за SwiftUI
bn: SwiftUI প্রাথমিক টিউটোরিয়াল
ca: Tutorial inicial de SwiftUI
cs: Úvodní kurz SwiftUI
da: SwiftUI for begyndere
de: SwiftUI-Einstiegskurs
el: Εισαγωγικό μάθημα SwiftUI
es: Tutorial inicial de SwiftUI
fi: SwiftUI-aloitusopas
fr: Tutoriel SwiftUI débutant
gu: SwiftUI પ્રારંભિક માર્ગદર્શિકા
he: מדריך SwiftUI למתחילים
hi: SwiftUI प्रारंभिक ट्यूटोरियल
hr: Početni vodič za SwiftUI
hu: Bevezetés a SwiftUI-ba
id: Tutorial dasar SwiftUI
it: Tutorial introduttivo a SwiftUI
ja: SwiftUI 入門チュートリアル
kk: SwiftUI бастауыш нұсқаулығы
kn: SwiftUI ಆರಂಭಿಕ ಪಾಠ
ko: SwiftUI 입문 튜토리얼
lt: SwiftUI pradžios pamoka
ml: SwiftUI പ്രാരംഭ പാഠം
mr: SwiftUI प्रारंभिक मार्गदर्शक
ms: Tutorial asas SwiftUI
nb: SwiftUI for nybegynnere
nl: SwiftUI beginnershandleiding
or: SwiftUI ଆରମ୍ଭିକ ପାଠ
pa: SwiftUI ਸ਼ੁਰੂਆਤੀ ਟਿਊਟੋਰਿਅਲ
pl: Podstawowy kurs SwiftUI
pt: Tutorial introdutório de SwiftUI
ro: Tutorial introductiv SwiftUI
ru: Вводный курс по SwiftUI
sk: Úvod do SwiftUI
sl: Uvodni vodič za SwiftUI
sv: SwiftUI för nybörjare
ta: SwiftUI அறிமுக பயிற்சி
te: SwiftUI ప్రారంభ పాఠం
th: บทเรียนเริ่มต้น SwiftUI
tr: SwiftUI başlangıç eğitimi
uk: Вступний курс SwiftUI
ur: SwiftUI ابتدائی ٹیوٹوریل
vi: Hướng dẫn nhập môn SwiftUI
zh_hans: SwiftUI 入门教程
zh_hant: SwiftUI 入門教程

source: SwiftUI View Lifecycle
ar: دورة حياة واجهة SwiftUI
bg: Жизнен цикъл на SwiftUI изгледа
bn: SwiftUI ভিউ লাইফসাইকেল
ca: Cicle de vida de les vistes de SwiftUI
cs: Životní cyklus view ve SwiftUI
da: SwiftUI-visningens livscyklus
de: Der Lebenszyklus von SwiftUI-Views
el: Ο κύκλος ζωής των SwiftUI views
es: Ciclo de vida vista SwiftUI
fi: SwiftUI-näkymän elinkaari
fr: Cycle de vie d'une vue SwiftUI
gu: SwiftUI વ્યૂ જીવનચક્ર
he: מחזור חיים תצוגת SwiftUI
hi: SwiftUI व्यू जीवनचक्र
hr: Životni ciklus SwiftUI prikaza
hu: SwiftUI nézet életciklus
id: Siklus hidup tampilan SwiftUI
it: Ciclo di vita vista SwiftUI
ja: SwiftUIビューライフサイクル
kk: SwiftUI көрініс өмірлік циклі
kn: SwiftUI ವೀಕ್ಷಣೆ ಜೀವನಚಕ್ರ
ko: SwiftUI 뷰 생명 주기
lt: SwiftUI vaizdo gyvavimo ciklas
ml: SwiftUI വ്യൂ ജീവിതചക്രം
mr: SwiftUI दृश्य जीवनचक्र
ms: Kitaran hayat paparan SwiftUI
nb: SwiftUI-visning livssyklus
nl: Levenscyclus van SwiftUI-weergave
or: SwiftUI ଭ୍ୟୁ ଜୀବନଚକ୍ର
pa: SwiftUI ਵਿਊ ਜੀਵਨ ਚੱਕਰ
pl: Cykl życia widoku SwiftUI
pt: Ciclo de vida visualização SwiftUI
ro: Ciclu de viață vizualizare SwiftUI
ru: Жизненный цикл SwiftUI-представления
sk: Životný cyklus zobrazenia SwiftUI
sl: Življenjski cikel pogleda SwiftUI
sv: SwiftUI-vy livscykel
ta: SwiftUI பார்வை வாழ்க்கைச் சுழற்சி
te: SwiftUI వీక్షణ జీవన చక్రం
th: วงจรชีวิตมุมมอง SwiftUI
tr: SwiftUI görünüm yaşam döngüsü
uk: Життєвий цикл SwiftUI-подання
ur: SwiftUI ویو لائف سائیکل
vi: Vòng đời chế độ xem SwiftUI
zh_hans: SwiftUI 视图生命周期
zh_hant: SwiftUI 視圖生命週期

source: Switches a value on or off.
ar: يبدّل قيمة تشغيلًا أو إيقافًا.
bg: Превключва стойност вкл. или изкл.
bn: একটি মান চালু বা বন্ধ করে।
ca: Activa o desactiva un valor.
cs: Přepíná hodnotu zapnuto/vypnuto.
da: Slår en værdi til eller fra.
de: Schaltet einen Wert ein oder aus.
el: Ενεργοποιεί ή απενεργοποιεί μια τιμή.
es: Activa o desactiva un valor.
fi: Kytkee arvon päälle tai pois.
fr: Active ou désactive une valeur.
gu: મૂલ્ય ચાલુ અથવા બંધ કરે છે.
he: מפעיל או מכבה ערך.
hi: किसी मान को चालू या बंद करता है।
hr: Uključuje ili isključuje vrijednost.
hu: Be- vagy kikapcsol egy értéket.
id: Mengaktifkan atau menonaktifkan nilai.
it: Attiva o disattiva un valore.
ja: 値のオン/オフを切り替えます。
kk: Мәнді қосады немесе өшіреді.
kn: ಮೌಲ್ಯವನ್ನು ಆನ್ ಅಥವಾ ಆಫ್ ಮಾಡುತ್ತದೆ.
ko: 값을 켜거나 끕니다.
lt: Įjungia arba išjungia reikšmę.
ml: ഒരു മൂല്യം ഓൺ അല്ലെങ്കിൽ ഓഫ് ആക്കും.
mr: मूल्य चालू किंवा बंद करतो.
ms: Menghidupkan atau mematikan nilai.
nb: Slår en verdi av eller på.
nl: Schakelt een waarde aan of uit.
or: ଏକ ମୂଲ୍ୟକୁ ଅନ୍ କିମ୍ବା ଅଫ୍ କରେ।
pa: ਕਿਸੇ ਮੁੱਲ ਨੂੰ ਚਾਲੂ ਜਾਂ ਬੰਦ ਕਰਦਾ ਹੈ।
pl: Włącza lub wyłącza wartość.
pt: Ativa ou desativa um valor.
ro: Activează sau dezactivează o valoare.
ru: Включает или выключает значение.
sk: Zapína alebo vypína hodnotu.
sl: Vklopi ali izklopi vrednost.
sv: Slår på eller av ett värde.
ta: ஒரு மதிப்பை ஆன் அல்லது ஆஃப் மாற்றும்.
te: ఒక విలువను ఆన్ లేదా ఆఫ్ చేస్తుంది.
th: สลับค่าเปิดหรือปิด
tr: Bir değeri açar veya kapatır.
uk: Вмикає або вимикає значення.
ur: کسی قدر کو آن یا آف کرتا ہے۔
vi: Bật hoặc tắt một giá trị.
zh_hans: 用于切换开关状态。
zh_hant: 用於切換開關狀態。

source: Switches between multiple views.
ar: يبدّل بين عدة عروض.
bg: Превключва между няколко изгледа.
bn: একাধিক ভিউয়ের মধ্যে বদলায়।
ca: Canvia entre diverses vistes.
cs: Přepíná mezi více zobrazeními.
da: Skifter mellem flere visninger.
de: Wechselt zwischen mehreren Ansichten.
el: Αλλάζει μεταξύ πολλών προβολών.
es: Cambia entre varias vistas.
fi: Vaihtaa useiden näkymien välillä.
fr: Passe entre plusieurs vues.
gu: ઘણા વ્યૂ વચ્ચે બદલે છે.
he: מחליף בין כמה תצוגות.
hi: कई व्यू के बीच बदलता है।
hr: Prebacuje između više prikaza.
hu: Több nézet között vált.
id: Beralih antar beberapa view.
it: Passa tra più viste.
ja: 複数のビューを切り替えます。
kk: Бірнеше көрініс арасында ауысады.
kn: ಬಹು ವೀಕ್ಷಣೆಗಳ ನಡುವೆ ಬದಲಾಯಿಸುತ್ತದೆ.
ko: 여러 뷰 사이를 전환합니다.
lt: Perjungia kelis rodinius.
ml: ഒന്നിലധികം വ്യൂകൾക്കിടയിൽ മാറുന്നു.
mr: अनेक व्ह्यूमध्ये बदलतो.
ms: Bertukar antara beberapa paparan.
nb: Bytter mellom flere visninger.
nl: Schakelt tussen meerdere weergaven.
or: ଅନେକ ଭ୍ୟୁ ମଧ୍ୟରେ ବଦଳାଏ।
pa: ਕਈ ਵਿਊਜ਼ ਵਿਚਕਾਰ ਬਦਲਦਾ ਹੈ।
pl: Przełącza między wieloma widokami.
pt: Alterna entre várias views.
ro: Comută între mai multe vizualizări.
ru: Переключается между несколькими представлениями.
sk: Prepína medzi viacerými zobrazeniami.
sl: Preklaplja med več pogledi.
sv: Växlar mellan flera vyer.
ta: பல வியூக்களுக்கு இடையில் மாறும்.
te: అనేక వీక్షణల మధ్య మారుతుంది.
th: สลับระหว่างหลายวิว
tr: Birden çok görünüm arasında geçiş yapar.
uk: Перемикає кілька подань.
ur: متعدد ویوز کے درمیان بدلتا ہے۔
vi: Chuyển giữa nhiều view.
zh_hans: 用于在多个视图之间切换。
zh_hant: 用於在多個視圖之間切換。

source: Switches quickly between options.
ar: يبدّل بسرعة بين الخيارات.
bg: Бързо превключва между опции.
bn: অপশনগুলোর মধ্যে দ্রুত বদলায়।
ca: Canvia ràpidament entre opcions.
cs: Rychle přepíná mezi volbami.
da: Skifter hurtigt mellem valg.
de: Wechselt schnell zwischen Optionen.
el: Αλλάζει γρήγορα μεταξύ επιλογών.
es: Cambia rápidamente entre opciones.
fi: Vaihtaa nopeasti vaihtoehtojen välillä.
fr: Passe rapidement d’une option à l’autre.
gu: વિકલ્પો વચ્ચે ઝડપથી બદલે છે.
he: מחליף במהירות בין אפשרויות.
hi: विकल्पों के बीच तेज़ी से बदलता है।
hr: Brzo prebacuje između opcija.
hu: Gyorsan vált az opciók között.
id: Beralih cepat antar opsi.
it: Passa rapidamente tra le opzioni.
ja: 選択肢をすばやく切り替えます。
kk: Опциялар арасында тез ауысады.
kn: ಆಯ್ಕೆಗಳ ನಡುವೆ ಬೇಗ ಬದಲಾಯಿಸುತ್ತದೆ.
ko: 옵션 사이를 빠르게 전환합니다.
lt: Greitai perjungia parinktis.
ml: ഓപ്ഷനുകൾക്കിടയിൽ വേഗത്തിൽ മാറുന്നു.
mr: पर्यायांमध्ये पटकन बदलतो.
ms: Bertukar pantas antara pilihan.
nb: Bytter raskt mellom valg.
nl: Schakelt snel tussen opties.
or: ବିକଳ୍ପଗୁଡ଼ିକ ମଧ୍ୟରେ ଶୀଘ୍ର ବଦଳାଏ।
pa: ਚੋਣਾਂ ਵਿਚਕਾਰ ਤੇਜ਼ੀ ਨਾਲ ਬਦਲਦਾ ਹੈ।
pl: Szybko przełącza opcje.
pt: Alterna rapidamente entre opções.
ro: Comută rapid între opțiuni.
ru: Быстро переключает варианты.
sk: Rýchlo prepína medzi možnosťami.
sl: Hitro preklaplja med možnostmi.
sv: Växlar snabbt mellan alternativ.
ta: விருப்பங்களுக்கு இடையில் விரைவாக மாறும்.
te: ఎంపికల మధ్య త్వరగా మారుతుంది.
th: สลับระหว่างตัวเลือกอย่างรวดเร็ว
tr: Seçenekler arasında hızlı geçiş yapar.
uk: Швидко перемикає варіанти.
ur: اختیارات کے درمیان تیزی سے بدلتا ہے۔
vi: Chuyển nhanh giữa các tùy chọn.
zh_hans: 适合在少量选项之间快速切换。
zh_hant: 適合在少量選項之間快速切換。

source: Terms
ar: شروط الاستخدام
bg: Условия
bn: ব্যবহারের শর্তাবলি
ca: Condicions d’ús
cs: Podmínky použití
da: Vilkår
de: Bedingungen
el: Όροι χρήσης
es: Términos
fi: Käyttöehdot
fr: Conditions
gu: ઉપયોગની શરતો
he: תנאי שימוש
hi: उपयोग की शर्तें
hr: Uvjeti korištenja
hu: Feltételek
id: Ketentuan
it: Termini
ja: 利用規約
kk: Пайдалану шарттары
kn: ಬಳಕೆಯ ನಿಯಮಗಳು
ko: 이용약관
lt: Naudojimo sąlygos
ml: ഉപയോഗ നിബന്ധనలు
mr: वापर अटी
ms: Terma
nb: Vilkår
nl: Voorwaarden
or: ବ୍ୟବହାର ନିୟମ
pa: ਵਰਤੋਂ ਦੀਆਂ ਸ਼ਰਤਾਂ
pl: Warunki
pt: Termos
ro: Termeni
ru: Условия
sk: Podmienky
sl: Pogoji
sv: Villkor
ta: பயன்பாட்டு விதிமுறைகள்
te: వినియోగ నిబంధనలు
th: ข้อกำหนดการใช้งาน
tr: Koşullar
uk: Умови
ur: استعمال کی شرائط
vi: Điều khoản
zh_hans: 使用条款
zh_hant: 使用條款

source: Test & Debug
ar: اختبار وتصحيح
bg: Тест и дебъг
bn: টেস্ট ও ডিবাগ
ca: Test i depuració
cs: Test a ladění
da: Test og fejlfinding
de: Testen und Debuggen
el: Δοκιμή και αποσφαλμάτωση
es: Prueba y depuración
fi: Testaus ja virheenkorjaus
fr: Test et débogage
gu: ટેસ્ટ અને ડિબગ
he: בדיקה וניפוי שגיאות
hi: टेस्ट और डिबग
hr: Test i ispravljanje
hu: Teszt és hibakeresés
id: Uji & debug
it: Test e debug
ja: テストとデバッグ
kk: Тестілеу және жөндеу
kn: ಟೆಸ್ಟ್ ಮತ್ತು ಡಿಬಗ್
ko: 테스트 및 디버그
lt: Testavimas ir derinimas
ml: ടെസ്റ്റ് & ഡീബഗ്
mr: टेस्ट आणि डिबग
ms: Uji & nyahpepijat
nb: Test og feilsøking
nl: Testen en debuggen
or: ଟେଷ୍ଟ ଏବଂ ଡିବଗ୍
pa: ਟੈਸਟ ਅਤੇ ਡੀਬਗ
pl: Test i debugowanie
pt: Teste e depuração
ro: Test și depanare
ru: Тест и отладка
sk: Test a ladenie
sl: Preizkus in razhroščevanje
sv: Test och felsökning
ta: சோதனை மற்றும் டிபக்
te: టెస్ట్ మరియు డీబగ్
th: ทดสอบและดีบัก
tr: Test ve hata ayıklama
uk: Тест і налагодження
ur: ٹیسٹ اور ڈیبگ
vi: Kiểm thử và gỡ lỗi
zh_hans: 测试和调试
zh_hant: 測試與偵錯

source: Text
ar: نص
bg: Текст
bn: টেক্সট
da: Tekst
el: Κείμενο
es: Texto
fi: Teksti
fr: Texte
gu: ટેક્સ્ટ
he: טקסט
hi: टेक्स्ट
hr: Tekst
hu: Szöveg
id: Teks
it: Testo
ja: テキスト
kk: Мәтін
kn: ಪಠ್ಯ
ko: 텍스트
lt: Tekstas
ml: ടെക്സ്റ്റ്
mr: मजकूर
ms: Teks
nb: Tekst
nl: Tekst
or: ଟେକ୍ସଟ୍
pa: ਟੈਕਸਟ
pl: Tekst
pt: Texto
ru: Текст
sl: Besedilo
ta: உரை
te: టెక్స్ట్
th: ข้อความ
tr: Metin
uk: Текст
ur: متن
vi: Văn bản
zh_hans: 文本
zh_hant: 文字
